load_test_results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m5s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 35s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<300' p(95)=16.27ms

    http_req_failed
    ✓ 'rate<0.001' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 4908    139.729075/s
    checks_succeeded...: 100.00% 4908 out of 4908
    checks_failed......: 0.00%   0 out of 4908

    ✓ status is 201
    ✓ reviewers assigned

    HTTP
    http_req_duration..............: avg=11.97ms  min=3.74ms  med=11.58ms  max=146.41ms p(90)=15.3ms   p(95)=16.27ms 
      { expected_response:true }...: avg=11.97ms  min=3.74ms  med=11.58ms  max=146.41ms p(90)=15.3ms   p(95)=16.27ms 
    http_req_failed................: 0.00%  0 out of 2455
    http_reqs......................: 2455   69.893007/s

    EXECUTION
    iteration_duration.............: avg=113.25ms min=104.3ms med=112.93ms max=247.65ms p(90)=116.65ms p(95)=117.55ms
    iterations.....................: 2454   69.864537/s
    vus............................: 1      min=1         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 838 kB 24 kB/s
    data_sent......................: 588 kB 17 kB/s



running (0m35.1s), 00/10 VUs, 2454 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  35s